app/Repositories/ArticleRepository.php

	public function create(array $data, int $userId): Article | false
	{
		$article = new $this->article;
		$article = $this->fillArticleObject($article, $data);

		if($article->save()) {
			$article->users()->attach($userId);
---
INSERT INTO "articles" ("title", "description", "updated_at", "created_at") VALUES ('Weather', 'Lorem ipsum dolor a sit amet...', '2024-03-18 20:02:45', '2024-03-18 20:02:45')
INSERT INTO "article_user" ("article_id", "user_id") VALUES (2, 1)

	public function getById(int $articleId): Article|null
	{
		return $this->article->find($articleId);
---
SELECT * FROM "articles" WHERE "articles"."id" = 1 LIMIT 1

	public function getPending(): \Illuminate\Database\Eloquent\Collection|array
	{
		return $this->article
			->doesntHave('reviews')
			->get();
---
SELECT * FROM "articles" WHERE not exists (SELECT * FROM "reviews" WHERE "articles"."id" = "reviews"."article_id")

	public function getByAuthor($userId): \Illuminate\Database\Eloquent\Collection|array
	{
		return $this->article
			->whereRelation('users', 'user_id', '=', $userId)
			->with(['reviews' => function($q) {
				$q->select('id', 'approved', 'article_id');
			}])
			->get(['id', 'title', 'description', 'created_at']);
---
SELECT "id", "approved", "article_id" FROM "reviews" WHERE "reviews"."article_id" in (1)
SELECT "id", "title", "description", "created_at" FROM "articles" WHERE exists (SELECT * FROM "users" inner join "article_user" on "users"."id" = "article_user"."user_id" WHERE "articles"."id" = "article_user"."article_id" and "user_id" = 1)