app/Repositories/ReviewRepository.php

SELECT * FROM "reviews" WHERE ("article_id" = '1' and "user_id" = 4) LIMIT 1
---
	public function getReview($articleId, $userId): Review|null
	{
		return $this->review->where(['article_id' => $articleId, 'user_id' => $userId] )->first();

INSERT INTO "reviews" ("article_id", "user_id", "approved", "created_at", "updated_at") VALUES ('1', 4, '1', '2024-03-18 20:11:01', '2024-03-18 20:11:01')
---
	public function postOrUpdateReview(array $data, int $userId): bool
	{
		$review = $this->getReview($data['article_id'], $userId) ?: new $this->review;
		$review = $this->fillReviewObject($review, $data, $userId);

		return (bool)$review->save();

SELECT * FROM "articles" WHERE "articles"."id" in (1)
SELECT * FROM "reviews" WHERE "user_id" = 4
---
	public function getStatsById(int $userId): array
	{
		$reviews = $this->review
			->with('article')
			->whereUserId($userId)
			->get();