app/Repositories/UserRepository.php

SELECT exists(SELECT * FROM "users" WHERE "email" = 'jd@mail.com') as "exists"
---
	public function exists($email): bool
	{
		return $this->user->whereEmail($email)->exists();

SELECT * FROM "roles" WHERE "roles"."id" in (1)
SELECT * FROM "users" WHERE "email" = 'jd@mail.com' LIMIT 1
---
	public function getByEmail($email): User
	{
		return $this->user->whereEmail($email)->with('role')->first();